dbaeumer.vscode-eslint
docker.docker
esbenp.prettier-vscode
formulahendry.code-runner       
github.copilot
github.copilot-chat
humao.rest-client
ms-azuretools.vscode-docker     
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance        
ms-vscode.live-server
ms-vscode.vscode-typescript-next
omthemes.omthemes
pkief.material-icon-theme
redhat.vscode-yaml
steoates.autoimport
stringham.move-ts